## Staging: cognito
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
      ~ auto_verified_attributes   = [
          - "email",
        ]
        id                         = "ca-central-1_Oimm2vbOL"
        name                       = "forms_user_pool"
      - sms_authentication_message = "Your authentication code is {####}. " -> null
        tags                       = {}
        # (11 unchanged attributes hidden)


      ~ admin_create_user_config {
            # (1 unchanged attribute hidden)

          ~ invite_message_template {
              ~ email_message = <<-EOT
                  - Welcome!  Please log in using the following credentials:
                  - Username: {username}
                  - Password: {####}
                  + Welcome!  Please log in using the following credentials:/n  Username: {username}/n  Password: {####}
                EOT
              ~ sms_message   = <<-EOT
                  - Welcome!  Please log in using the following credentials:
                  - Username: {username}
                  - Password: {####}
                  + Welcome!  Please log in using the following credentials:/n  Username: {username}/n  Password: {####}
                EOT
                # (1 unchanged attribute hidden)
            }
        }


      ~ password_policy {
          - temporary_password_validity_days = 7 -> null
            # (5 unchanged attributes hidden)
        }


        # (4 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.forms will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "forms" {
      ~ callback_urls                        = [
          - "http://localhost:3000/api/auth/callback/cognito",
          + "https://localhost:3000/api/auth/callback/cognito",
            # (1 unchanged element hidden)
        ]
        id                                   = "3145gkeetee51d4dh2k2kekrd7"
        name                                 = "forms_client"
        # (15 unchanged attributes hidden)
    }

  # aws_cognito_user_pool_domain.forms will be created
  + resource "aws_cognito_user_pool_domain" "forms" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "forms"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = "ca-central-1_Oimm2vbOL"
      + version                     = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.cognito_client_secret"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
